app/controllers/logs_controller.rb

INSERT INTO "logs" ("activity", "amount_exercise", "ate", "bing", "created_at", "drink", "emotions", "exercise", "exercise_description", "location", "people", "thoughts", "time", "triggers", "updated_at", "user_id", "vomit_laxative") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
	def create
		@log = Log.create(log_params)